In [1]:
import sqlite3

In [ ]:
#Función para pasar de archivos sqlite a csv
def sqlite_to_csv(file_path, table_name, output_file):
    """ Creates a csv file from sqlite file

        Args:   
            file_path ([str]): path of the sqlite file to be converted
            table_name ([str]): name of the table to be converted
            output_file ([str]): name of the output csv file
    """
    # Creates SQL connection
    try:
        connection = sqlite3.connect(file_path, isolation_level=None, detect_types=sqlite3.PARSE_COLNAMES)
    except FileNotFoundError:
        print("ERROR: File not found.")
    except:
        print("ERROR: SQL connection not created.")

    # Reads table from SQLite file and exports it to a csv file
    try:
        database = pd.read_sql_query("SELECT * FROM " + table_name, connection)
        database.to_csv(output_file, index=False)
    except:
        print("ERROR: CSV file not created.")

In [2]:
import pandas as pd

In [3]:
dir_db= "chinook.db"
#Conexion a la base de datos que esta en sqlite3
conn = sqlite3.connect(dir_db)

In [4]:
#Creamos el cursor
cursor = conn.cursor()

In [14]:
query = """
SELECT *
FROM genres
"""

In [15]:
mi_query= cursor.execute(query)

In [16]:
mi_query.fetchall()

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera'),
 (90, 'hola')]

In [5]:
pd.read_sql_query(query, conn)

NameError: name 'query' is not defined

In [19]:
query = """
SELECT *
FROM customers, invoices
WHERE customers.CustomerId = invoices.CustomerId
"""
pd.read_sql_query(query,conn)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

In [20]:
#Es lo mismo que antes
#INNER JOIN me devuelve esto
# FULL JOIN seria todas las filas, la union de las dos "tablas" completas
query = """
SELECT *
FROM customers
JOIN invoices ON customers.CustomerId = invoices.CustomerId
"""

pd.read_sql_query(query,conn)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

In [21]:
query = """
SELECT c.LastName
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
"""

pd.read_sql_query(query,conn)

       LastName
0     Gonçalves
1     Gonçalves
2     Gonçalves
3     Gonçalves
4     Gonçalves
..          ...
407  Srivastava
408  Srivastava
409  Srivastava
410  Srivastava
411  Srivastava

[412 rows x 1 columns]

In [24]:
query = """
SELECT c.FirstName, i.InvoiceId, i.InvoiceDate, i.BillingCountry
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country = "Brazil"
"""
pd.read_sql_query(query,conn)

    FirstName  InvoiceId          InvoiceDate BillingCountry
0        Luís         98  2010-03-11 00:00:00         Brazil
1        Luís        121  2010-06-13 00:00:00         Brazil
2        Luís        143  2010-09-15 00:00:00         Brazil
3        Luís        195  2011-05-06 00:00:00         Brazil
4        Luís        316  2012-10-27 00:00:00         Brazil
5        Luís        327  2012-12-07 00:00:00         Brazil
6        Luís        382  2013-08-07 00:00:00         Brazil
7     Eduardo         25  2009-04-09 00:00:00         Brazil
8     Eduardo        154  2010-11-14 00:00:00         Brazil
9     Eduardo        177  2011-02-16 00:00:00         Brazil
10    Eduardo        199  2011-05-21 00:00:00         Brazil
11    Eduardo        251  2012-01-09 00:00:00         Brazil
12    Eduardo        372  2013-07-02 00:00:00         Brazil
13    Eduardo        383  2013-08-12 00:00:00         Brazil
14  Alexandre         57  2009-09-06 00:00:00         Brazil
15  Alexandre         68  2009-10-17 00:00:00         Brazil
16  Alexandre        123  2010-06-17 00:00:00         Brazil
17  Alexandre        252  2012-01-22 00:00:00         Brazil
18  Alexandre        275  2012-04-25 00:00:00         Brazil
19  Alexandre        297  2012-07-28 00:00:00         Brazil
20  Alexandre        349  2013-03-18 00:00:00         Brazil
21    Roberto         34  2009-05-23 00:00:00         Brazil
22    Roberto        155  2010-11-14 00:00:00         Brazil
23    Roberto        166  2010-12-25 00:00:00         Brazil
24    Roberto        221  2011-08-25 00:00:00         Brazil
25    Roberto        350  2013-03-31 00:00:00         Brazil
26    Roberto        373  2013-07-03 00:00:00         Brazil
27    Roberto        395  2013-10-05 00:00:00         Brazil
28   Fernanda         35  2009-06-05 00:00:00         Brazil
29   Fernanda         58  2009-09-07 00:00:00         Brazil
30   Fernanda         80  2009-12-10 00:00:00         Brazil
31   Fernanda        132  2010-07-31 00:00:00         Brazil
32   Fernanda        253  2012-01-22 00:00:00         Brazil
33   Fernanda        264  2012-03-03 00:00:00         Brazil
34   Fernanda        319  2012-11-01 00:00:00         Brazil

In [27]:
query = """
SELECT i.*
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country = "Brazil"
"""
pd.read_sql_query(query,conn)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
5,327,1,2012-12-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,13.86
6,382,1,2013-08-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,8.91
7,25,10,2009-04-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,8.91
8,154,10,2010-11-14 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
9,177,10,2011-02-16 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,3.96
10,199,10,2011-05-21 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,5.94
11,251,10,2012-01-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,0.99
12,372,10,2013-07-02 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
13,383,10,2013-08-12 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,13.86
14,57,11,2009-09-06 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
15,68,11,2009-10-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,13.86
16,123,11,2010-06-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,8.91
17,252,11,2012-01-22 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
18,275,11,2012-04-25 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,3.96
19,297,11,2012-07-28 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,5.94
20,349,11,2013-03-18 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,0.99
21,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99
22,155,12,2010-11-14 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
23,166,12,2010-12-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,13.86
24,221,12,2011-08-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,8.91
25,350,12,2013-03-31 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
26,373,12,2013-07-03 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,3.96
27,395,12,2013-10-05 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,5.94
28,35,13,2009-06-05 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
29,58,13,2009-09-07 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,3.96
30,80,13,2009-12-10 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,5.94
31,132,13,2010-07-31 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,0.99
32,253,13,2012-01-22 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
33,264,13,2012-03-03 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,13.86
34,319,13,2012-11-01 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,8.91

In [29]:
query = """
SELECT i.*, e.LastName || " " || e.FirstName as "Nombre completo"
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
"""
pd.read_sql_query(query,conn)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,Nombre completo
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98,Peacock Jane
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96,Peacock Jane
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94,Peacock Jane
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99,Peacock Jane
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98,Peacock Jane
...,...,...,...,...,...,...,...,...,...,...
407,88,57,2010-01-13 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,17.91,Johnson Steve
408,217,57,2011-08-20 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,1.98,Johnson Steve
409,240,57,2011-11-22 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,3.96,Johnson Steve
410,262,57,2012-02-24 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,5.94,Johnson Steve
411,314,57,2012-10-14 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,0.99,Johnson Steve

In [9]:
#4. 
query = """
SELECT c.FirstName "Cliente", c.Country, e.FirstName "Empleado", i.Total
FROM invoices i
JOIN customers c ON i.CustomerId = c.CustomerId
JOIN employees e ON e.EmployeeId = c.supportRepId

"""
pd.read_sql_query(query,conn)

    Cliente Country Empleado  Total
0      Luís  Brazil     Jane   3.98
1      Luís  Brazil     Jane   3.96
2      Luís  Brazil     Jane   5.94
3      Luís  Brazil     Jane   0.99
4      Luís  Brazil     Jane   1.98
..      ...     ...      ...    ...
407    Puja   India     Jane   5.94
408    Puja   India     Jane   1.99
409    Puja   India     Jane   1.98
410    Puja   India     Jane  13.86
411    Puja   India     Jane   8.91

[412 rows x 4 columns]

In [11]:
#5.
query= """
SELECT it.TrackId, t.Name
FROM invoice_items it
JOIN tracks t ON t.TrackId = it.TrackId
"""
pd.read_sql_query(query,conn)

      TrackId                                               Name
0           1            For Those About To Rock (We Salute You)
1           2                                  Balls to the Wall
2           2                                  Balls to the Wall
3           3                                    Fast As a Shark
4           4                                  Restless and Wild
...       ...                                                ...
2235     3494  Symphony No. 2, Op. 16 -  "The Four Temperamen...
2236     3496    Étude 1, In C Major - Preludio (Presto) - Liszt
2237     3499  Pini Di Roma (Pinien Von Rom) \ I Pini Della V...
2238     3500  String Quartet No. 12 in C Minor, D. 703 "Quar...
2239     3500  String Quartet No. 12 in C Minor, D. 703 "Quar...

[2240 rows x 2 columns]

In [34]:
#5.
query5= """
SELECT t.name, ii.InvoiceLineId, i.invoiceId
FROM tracks t
JOIN invoice_items ii ON ii.trackId = t.trackId
JOIN invoices i ON i.invoiceId= ii.invoiceId
"""
pd.read_sql_query(query5,conn)

                               Name  InvoiceLineId  InvoiceId
0               Experiment In Terra            531         98
1                 Take the Celestra            532         98
2                 Shout It Out Loud            649        121
3                  Calling Dr. Love            650        121
4                          Strutter            651        121
...                             ...            ...        ...
2235           Esporrei Na Manivela           1537        284
2236  No Fundo Do Quintal Da Escola           1538        284
2237                 Que Luz É Essa           1539        284
2238          The Power Of Equality           1540        284
2239   Mellowship Slinky In B Major           1541        284

[2240 rows x 3 columns]

In [33]:
query6= """
SELECT t.name "Nombre Canción", mt.name "Formato", al.Title "Album", g.name "Genero"
FROM tracks t
JOIN media_types mt ON t.mediaTypeId= mt.mediaTypeId
JOIN albums al ON t.albumId = al.albumId
JOIN genres g ON g.GenreId = t.GenreId
"""
pd.read_sql_query(query6,conn)

,Nombre Canción,Formato,Album,Genero
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

In [50]:
#6. 
query= """
SELECT t.Name, mt.MediaTypeId, g.Genreid, a.Title
FROM tracks t
JOIN albums a ON a.AlbumId= t.AlbumId
JOIN media_types mt ON mt.MediaTypeId = t.MediaTypeId
JOIN genres g ON g.GenreId = t.GenreId
"""
pd.read_sql_query(query,conn)

,Name,MediaTypeId,GenreId,Title
0,For Those About To Rock (We Salute You),1,1,For Those About To Rock We Salute You
1,Balls to the Wall,2,1,Balls to the Wall
2,Fast As a Shark,2,1,Restless and Wild
3,Restless and Wild,2,1,Restless and Wild
4,Princess of the Dawn,2,1,Restless and Wild
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,2,24,Respighi:Pines of Rome
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",2,24,Schubert: The Late String Quartets & String Qu...
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",2,24,Monteverdi: L'Orfeo
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",2,24,Mozart: Chamber Music
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",2,25,Mozart Gala: Famous Arias

In [20]:
query7= """
SELECT p.Name, COUNT(pt.trackId)
FROM playlists p
LEFT JOIN playlist_track pt ON p.PlaylistId = pt.PlaylistId
GROUP BY p.PlaylistId
"""
pd.read_sql_query(query7,conn)

                          Name  COUNT(pt.trackId)
0                        Music               3290
1                       Movies                  0
2                     TV Shows                213
3                   Audiobooks                  0
4                   90’s Music               1477
5                   Audiobooks                  0
6                       Movies                  0
7                        Music               3290
8                 Music Videos                  1
9                     TV Shows                213
10             Brazilian Music                 39
11                   Classical                 75
12   Classical 101 - Deep Cuts                 25
13  Classical 101 - Next Steps                 25
14  Classical 101 - The Basics                 25
15                      Grunge                 15
16         Heavy Metal Classic                 26
17                 On-The-Go 1                  1

In [64]:
#7. 
query =  """
SELECT t.Name,pt.PlaylistID, t.TrackId, COUNT(*)
FROM playlist_track pt
JOIN playlists pl ON pl.PlaylistId = pt.PlaylistId
JOIN tracks t ON t.TrackId = pt.TrackId
GROUP BY pt.PlaylistId
"""
pd.read_sql_query(query,conn)

,Name,PlaylistId,TrackId,COUNT(*)
0,For Those About To Rock (We Salute You),1,1,3290
1,Battlestar Galactica: The Story So Far,3,2819,213
2,Fast As a Shark,5,3,1477
3,For Those About To Rock (We Salute You),8,1,3290
4,"Band Members Discuss Tracks from ""Revelations""",9,3402,1
5,Battlestar Galactica: The Story So Far,10,2819,213
6,Sozinho,11,215,39
7,Intoitus: Adorate Deum,12,3403,75
8,"Prometheus Overture, Op. 43",13,3479,25
9,"Toccata and Fugue in D Minor, BWV 565: I. Toccata",14,3430,25
10,Intoitus: Adorate Deum,15,3403,25
11,Man In The Box,16,52,15
12,For Those About To Rock (We Salute You),17,1,26
13,Now's The Time,18,597,1

In [21]:

query8=  """
SELECT e.FirstName, SUM(i.Total) "Ventas"
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON i.CustomerId = c.CustomerId
GROUP BY e.EmployeeId
"""
pd.read_sql_query(query8,conn)

  FirstName  Ventas
0      Jane  833.04
1  Margaret  775.40
2     Steve  720.16

In [25]:
query9 = """
SELECT e.FirstName, SUM(i.Total) "Ventas"
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON i.CustomerId = c.CustomerId
WHERE i.InvoiceDate LIKE "2009%"
GROUP BY e.EmployeeId
ORDER BY Ventas DESC
LIMIT 1
"""
pd.read_sql_query(query9,conn)

  FirstName  Ventas
0     Steve  164.34

In [31]:
query10= """
SELECT ar.Name, SUM(ii.UnitPrice) "Ventas"
FROM artists ar
JOIN albums al ON al.artistId = ar.artistId
JOIN tracks t ON al.albumId = t.albumId
JOIN invoice_items ii ON t.trackId = ii.trackID
GROUP BY ar.ArtistId
ORDER BY Ventas DESC
LIMIT 3
"""
pd.read_sql_query(query10,conn)

          Name  Ventas
0  Iron Maiden  138.60
1           U2  105.93
2    Metallica   90.09

In [35]:
conn.close()